import argparse
import textwrap
import base64

def encode(data):
    encoded_bytes = base64.b64encode(data.encode('utf-8'))
    return encoded_bytes.decode('utf-8')

def decode(data):
    decoded_bytes = base64.b64decode(data)
    return decoded_bytes.decode('utf-8')
if __name__ == "__main__":
    banner = """
          _____                    _____                    _____                    _____          
         /\    \                  /\    \                  /\    \                  /\    \         
        /::\    \                /::\    \                /::\    \                /::\    \        
       /::::\    \              /::::\    \              /::::\    \              /::::\    \       
      /::::::\    \            /::::::\    \            /::::::\    \            /::::::\    \      
     /:::/\:::\    \          /:::/\:::\    \          /:::/\:::\    \          /:::/\:::\    \     
    /:::/__\:::\    \        /:::/__\:::\    \        /:::/__\:::\    \        /:::/__\:::\    \    
   /::::\   \:::\    \      /::::\   \:::\    \       \:::\   \:::\    \      /::::\   \:::\    \   
  /::::::\   \:::\    \    /::::::\   \:::\    \    ___\:::\   \:::\    \    /::::::\   \:::\    \  
 /:::/\:::\   \:::\ ___\  /:::/\:::\   \:::\    \  /\   \:::\   \:::\    \  /:::/\:::\   \:::\    \ 
/:::/__\:::\   \:::|    |/:::/  \:::\   \:::\____\/::\   \:::\   \:::\____\/:::/__\:::\   \:::\____\
\:::\   \:::\  /:::|____|\::/    \:::\  /:::/    /\:::\   \:::\   \::/    /\:::\   \:::\   \::/    /
 \:::\   \:::\/:::/    /  \/____/ \:::\/:::/    /  \:::\   \:::\   \/____/  \:::\   \:::\   \/____/ 
  \:::\   \::::::/    /            \::::::/    /    \:::\   \:::\    \       \:::\   \:::\    \     
   \:::\   \::::/    /              \::::/    /      \:::\   \:::\____\       \:::\   \:::\____\    
    \:::\  /:::/    /               /:::/    /        \:::\  /:::/    /        \:::\   \::/    /    
     \:::\/:::/    /               /:::/    /          \:::\/:::/    /          \:::\   \/____/     
      \::::::/    /               /:::/    /            \::::::/    /            \:::\    \         
       \::::/    /               /:::/    /              \::::/    /              \:::\____\        
        \::/____/                \::/    /                \::/    /                \::/    /        
         ~~                       \/____/                  \/____/                  \/____/         
                                                                                                    
"""
print(banner)

def main():
    parser = argparse.ArgumentParser(description='Base64 编解码工具')
    parser.add_argument('-e', '--encode', type=str, help='待编码的字符串')
    parser.add_argument('-d', '--decode', type=str, help='待解码的 Base64 字符串')

    args = parser.parse_args()

    if args.encode:
        print('编码结果:', encode(args.encode))
    elif args.decode:
        print('解码结果:', decode(args.decode))
    else:
        print('请提供需要编码或解码的字符串。')

if __name__ == '__main__':
    main()